National_bank_xml/PRISTIGAO_RTGS.XML

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>VfMIsoIfo/63JQsk3l/Zt0vtra7cUVK7Tt4RoFVhKpPJrP9f90XaugKyH+/g048gK0GNKqgtoOtf&#13;
93sPAZqBp4cVecz4w8uXOb5FDWfRkcuu0ZcoYZ1Guf8vnnWPKJSR2SlIO2Kwg1fJYCPlV3RFxI9G&#13;
KidB8ayVScgl8P4bSUSMAO5J79lXBoYBCGNkYYN8Fnt0kmWpyBdtNktJjRSdysrZ3xb6xeB7wRDF&#13;
aeq3HKFkC55bASS0k2pGdvWPESL+WoWGlw1ggQOQaDfqaeYSrCipCzVA5hVIRYSp16aG0I96gJD8&#13;
cmyynDxq5ePHvBElJM8hUANBT5l449aC4urq+g==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>fLPLMQo1wi1gR4M11rM6KyCLcd4QNVaLGinwHh7kAwaZgh8lmdD3rz7AJPZHAmuoXRmAgepVcht6&#13;
NLF021nVJhr81yIpd6095Rvq6fU54PX6PNVbklSO5F8FXFj9jH2gTUcEP5XzUiiL3m9Ny+wYumbO&#13;
mZi/LovffCQdnR6ucPCGddPto4xmX6Ru1JsSS3TgUQaIrwYFztIxRCmwmots8k6LsMiyezJ9Q7IV&#13;
/bhbUGEjtEk/kKN6VJZsuCqSVKsy5dLdLf9BydiTqiccNCmRmfWbvX+VLnAvIaZAUGLmlAISk4Qh&#13;
fF45GBHt13RPdREgyv+mjoI4adtR16TfatjaTgS9+G2FvKM5s/AJ+O821gCNw9nqRYoxlQk3CMBQ&#13;
8vW8E0aNU8vY0GTpiad5AJjT9C/HdlrYM/c5lSKNEwuhxvuaDlpxmFyQa/uFXZ4d7v4MF3dfhJK4&#13;
8B0STs+k/vY/ftHO5lEvl5+CbqQvWHPbiIAZKC4EC63eysB2UTHwaWWJwG+e7d36uODu0wWcWU0S&#13;
dbYaOQcpCEnaeNs8Vu6eistJF9c+7w7l572KAPsGINKnTIk4M+nm2MnyiCFD9Bk76BVhMcHxcttB&#13;
GNTDUbVkk9avzGu6LcGKV+K0KG9ussLWRafKcN+6eiojMnOHKp7KNg0zRr2phYBJ0R9ksUL4YQPd&#13;
bE5ObSTmCErovY9CjgykznU93TnCaW97D4TZ3wOQgBDWU2y93YzDRxclUq8cN2PCIF4s5J9zZAuk&#13;
UeKIBfx9WQA/ltIaGqrlT2zX7g+QIXLNTYwVOSxQfPg2A14labEe3PJ3UCt1/lFR9VHCEGQvnHmD&#13;
nDvQKJOj8B0M6Evd7cKwFlEd0fUyw0aaViouLp3TogRyXTzXjzypx0gH9K9n/OzE1/n8KavDNy4I&#13;
177IEhEYAio6dKUiDXB1FRhN9uR71Xd5hXhpVloC+7wdVJO2XKeZGXLQK5CZ6h6hDhRYHPRT3lLJ&#13;
XZEzggZJp7XwgD1rWzmF8FzS6+U4r05998n6lcHB4ugXOFg+FWpUbAwPYil+nfKh4eJSabsIWC1N&#13;
xSfwt2iQsntcIl5QmbbD+K1z776U8EWAi+Srw36e/wOAsF40XBOKYAgXgBgLgUpedkTCjHymdUq4&#13;
DtLSP0y7G9erKiUTvWOCz8huZpI8DfLjZOjSIjwFOb8kBpPf5P+OLZ3YFbYHEme3I3pRDONLXA5A&#13;
pKDqZhn5QeotPLMmL8q5zWnT9lAulvfue8vswwMfsgFzlb/V+Jem4ERcO2PmJx6BOftEB/RuAqen&#13;
t4WMWEX8cF1d0OMrk7wTwtGQyZiEaPG2E211TjVs7l69sDnvba2NOVn78EZ8UEk8D0urYgNraQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>G4cbratsJTqn82b3ndK1H3sN5+A=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
INiVfdK/9bbeKdJ7fhj5xJnUJZ10Zf9KysjYfYuEmYUerv6vOOpzGTJQjVA3AbG9pznTE0K04MNJ&#13;
9pnhIel/LdssQAUmVJHK8yWzaplE5+xUBU6CDhSYACuWqo0IYqX5veKTAyHD6MZ11ern4cEGiozA&#13;
g4Xdc9IfsYQpojCj9xt7Ru1c9QPcVbgaTJUaVUYU1SJ/0+MZy1WaC/tj5phnTJsxakTQLEPQvhzf&#13;
UaqzG8lexkZqZ482TaJh6iyIRwOIF2Z/cNPi+aK1yX1vNWUyzJ5naNbXxY7oUK50iCNvC6iRyArz&#13;
rs0ckEgDTWXW/o/Nw/6b+tadEwFdy+KdI2UxPg==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>